Oryx-Embedded/CycloneCRYPTO/hardware/mimxrt1180/mimxrt1180_crypto_cipher.c
         //Check status code
         if(status == kStatus_Success)
         {
            //Acquire exclusive access to the ELE module
            osAcquireMutex(&mimxrt1180CryptoMutex);

            //Perform AES-CBC decryption
            for(i = 0; i < length && status == kStatus_Success; i += n)
            {
               //Limit the number of data to process at a time
               n = MIN(length - i, MIMXRT1180_ELE_BUFFER_SIZE);
               //Copy the ciphertext to the buffer
               osMemcpy(eleBufferIn, c + i, n);
               //Save the last input block
               osMemcpy(block, eleBufferIn + n - AES_BLOCK_SIZE, AES_BLOCK_SIZE);

               //Set cipher parameters
               genericCipher.data = (uint32_t) eleBufferIn;
               genericCipher.output = (uint32_t) eleBufferOut;
               genericCipher.size = n;
               genericCipher.key = (uint32_t) aesContext->ek;
               genericCipher.key_size = keySize;
               genericCipher.iv = (uint32_t) iv;
               genericCipher.iv_size = AES_BLOCK_SIZE;
               genericCipher.algo = kAES_CBC;
               genericCipher.mode = kDecrypt;

               //Decrypt data
               status = ELE_GenericCipher(MU_APPS_S3MUA, &genericCipher);

               //Check status code
               if(status == kStatus_Success)
               {
                  //Copy the resulting plaintext
                  osMemcpy(p + i, eleBufferOut, n);
                  //Update the value of the initialization vector
                  osMemcpy(iv, block, AES_BLOCK_SIZE);
               }
            }
         }

         //Release exclusive access to the ELE module
         osReleaseMutex(&mimxrt1180CryptoMutex);
      }
      else
      {
         //The length of the payload must be a multiple of the block size
         status = kStatus_InvalidArgument;
      }
   }
   //Unknown cipher algorithm?
   else
   {
      size_t i;
      uint8_t t[16];

      //CBC mode operates in a block-by-block fashion
      while(length >= cipher->blockSize)
      {
         //Save input block
         osMemcpy(t, c, cipher->blockSize);

         //Decrypt the current block
         cipher->decryptBlock(context, c, p);

         //XOR output block with IV contents
         for(i = 0; i < cipher->blockSize; i++)
         {
            p[i] ^= iv[i];
         }

         //Update IV with input block contents
         osMemcpy(iv, t, cipher->blockSize);

         //Next block
         c += cipher->blockSize;
         p += cipher->blockSize;
         length -= cipher->blockSize;
      }

      //The length of the payload must be a multiple of the block size
      if(length != 0)
      {
         status = kStatus_InvalidArgument;
      }
   }

   //Return status code
   return (status == kStatus_Success) ? NO_ERROR : ERROR_FAILURE;
}

#endif
#if (CTR_SUPPORT == ENABLED)

/**
 * @brief CTR encryption
 * @param[in] cipher Cipher algorithm
 * @param[in] context Cipher algorithm context
 * @param[in] m Size in bits of the specific part of the block to be incremented
 * @param[in,out] t Initial counter block
 * @param[in] p Plaintext to be encrypted
 * @param[out] c Ciphertext resulting from the encryption
 * @param[in] length Total number of data bytes to be encrypted
 * @return Error code
 **/

error_t ctrEncrypt(const CipherAlgo *cipher, void *context, uint_t m,
   uint8_t *t, const uint8_t *p, uint8_t *c, size_t length)
{
   status_t status;
   ele_generic_cipher_t genericCipher;

   //Initialize status code
   status = kStatus_Success;

   //Check the value of the parameter
   if((m % 8) == 0 && m <= (cipher->blockSize * 8))
   {
      //Determine the size, in bytes, of the specific part of the block to be
      //incremented
      m = m / 8;

      //AES cipher algorithm?
      if(cipher == AES_CIPHER_ALGO)
      {
         size_t i;
         size_t k;
         size_t n;
         size_t keySize;
         AesContext *aesContext;

         //Point to the AES context
         aesContext = (AesContext *) context;

         //Get the length of the key
         if(aesContext->nr == 10)
         {
            //10 rounds are required for 128-bit key
            keySize = 16;
         }
         else if(aesContext->nr == 12)
         {
            //12 rounds are required for 192-bit key
            keySize = 24;
         }
         else if(aesContext->nr == 14)
         {
            //14 rounds are required for 256-bit key
            keySize = 32;
         }
         else
         {
            //Invalid key length
            status = kStatus_Fail;
         }

         //Check status code
         if(status == kStatus_Success)
         {
            //Acquire exclusive access to the ELE module
            osAcquireMutex(&mimxrt1180CryptoMutex);

            //Perform AES-CTR encryption
            for(i = 0; i < length && status == kStatus_Success; i += n)
            {
               //Limit the number of data to process at a time
               k = 256 - t[AES_BLOCK_SIZE - 1];
               n = k * AES_BLOCK_SIZE;
               n = MIN(n, length - i);
               n = MIN(n, MIMXRT1180_ELE_BUFFER_SIZE);
               k = (n + AES_BLOCK_SIZE - 1) / AES_BLOCK_SIZE;

               //Copy the plaintext to the buffer
               osMemcpy(eleBufferIn, p + i, n);
               //Copy the counter block
               osMemcpy(eleInitVector, t, AES_BLOCK_SIZE);

               //Set cipher parameters
               genericCipher.data = (uint32_t) eleBufferIn;
               genericCipher.output = (uint32_t) eleBufferOut;
               genericCipher.size = k * AES_BLOCK_SIZE;
               genericCipher.key = (uint32_t) aesContext->ek;
               genericCipher.key_size = keySize;
               genericCipher.iv = (uint32_t) eleInitVector;
               genericCipher.iv_size = AES_BLOCK_SIZE;
               genericCipher.algo = kAES_CTR;
               genericCipher.mode = kEncrypt;

               //Encrypt data
               status = ELE_GenericCipher(MU_APPS_S3MUA, &genericCipher);

