Oryx-Embedded/CycloneCRYPTO/hardware/mimxrt1180/mimxrt1180_crypto_cipher.c
   //Check status code
   if(status == kStatus_Success)
   {
      //Acquire exclusive access to the ELE module
      osAcquireMutex(&mimxrt1180CryptoMutex);

      //Set cipher parameters
      genericAead.data = (uint32_t) c;
      genericAead.output = (uint32_t) p;
      genericAead.size = length;
      genericAead.key = (uint32_t) aesContext->ek;
      genericAead.key_size = keySize;
      genericAead.iv = (uint32_t) iv;
      genericAead.iv_size = ivLen;
      genericAead.aad = (uint32_t) a;
      genericAead.aad_size = aLen;
      genericAead.tag = (uint32_t) t;
      genericAead.tag_size = tLen;
      genericAead.algo = kAES_GCM;
      genericAead.mode = kDecrypt;

      //Perform AES-GCM decryption
      status = ELE_GenericAead(MU_APPS_S3MUA, &genericAead);

      //Release exclusive access to the ELE module
      osReleaseMutex(&mimxrt1180CryptoMutex);
   }

   //Return status code
   return (status == kStatus_Success) ? NO_ERROR : ERROR_FAILURE;
}

#endif
#if (CCM_SUPPORT == ENABLED)

/**
 * @brief Authenticated encryption using CCM
 * @param[in] cipher Cipher algorithm
 * @param[in] context Cipher algorithm context
 * @param[in] n Nonce
 * @param[in] nLen Length of the nonce
 * @param[in] a Additional authenticated data
 * @param[in] aLen Length of the additional data
 * @param[in] p Plaintext to be encrypted
 * @param[out] c Ciphertext resulting from the encryption
 * @param[in] length Total number of data bytes to be encrypted
 * @param[out] t MAC resulting from the encryption process
 * @param[in] tLen Length of the MAC
 * @return Error code
 **/

error_t ccmEncrypt(const CipherAlgo *cipher, void *context, const uint8_t *n,
   size_t nLen, const uint8_t *a, size_t aLen, const uint8_t *p, uint8_t *c,
   size_t length, uint8_t *t, size_t tLen)
{
   status_t status;
   size_t keySize;
   AesContext *aesContext;
   ele_generic_aead_t genericAead;

   //Make sure the GCM context is valid
   if(context == NULL)
      return ERROR_INVALID_PARAMETER;

   //Check the length of the authentication tag
   if(tLen < 4 || tLen > 16)
      return ERROR_INVALID_LENGTH;

   //Initialize status code
   status = kStatus_Success;

   //Point to the AES context
   aesContext = (AesContext *) context;

   //Get the length of the key
   if(aesContext->nr == 10)
   {
      //10 rounds are required for 128-bit key
      keySize = 16;
   }
   else if(aesContext->nr == 12)
   {
      //12 rounds are required for 192-bit key
      keySize = 24;
   }
   else if(aesContext->nr == 14)
   {
      //14 rounds are required for 256-bit key
      keySize = 32;
   }
   else
   {
      //Invalid key length
      status = kStatus_Fail;
   }

   //Check status code
   if(status == kStatus_Success)
   {
      //Acquire exclusive access to the ELE module
      osAcquireMutex(&mimxrt1180CryptoMutex);

      //Set cipher parameters
      genericAead.data = (uint32_t) p;
      genericAead.output = (uint32_t) c;
      genericAead.size = length;
      genericAead.key = (uint32_t) aesContext->ek;
      genericAead.key_size = keySize;
      genericAead.iv = (uint32_t) n;
      genericAead.iv_size = nLen;
      genericAead.aad = (uint32_t) a;
      genericAead.aad_size = aLen;
      genericAead.tag = (uint32_t) t;
      genericAead.tag_size = tLen;
      genericAead.algo = kAES_CCM;
      genericAead.mode = kEncrypt;

      //Perform AES-CCM encryption
      status = ELE_GenericAead(MU_APPS_S3MUA, &genericAead);

      //Release exclusive access to the ELE module
      osReleaseMutex(&mimxrt1180CryptoMutex);
   }

   //Return status code
   return (status == kStatus_Success) ? NO_ERROR : ERROR_FAILURE;
}


/**
 * @brief Authenticated decryption using CCM
 * @param[in] cipher Cipher algorithm
 * @param[in] context Cipher algorithm context
 * @param[in] n Nonce
 * @param[in] nLen Length of the nonce
 * @param[in] a Additional authenticated data
 * @param[in] aLen Length of the additional data
 * @param[in] c Ciphertext to be decrypted
 * @param[out] p Plaintext resulting from the decryption
 * @param[in] length Total number of data bytes to be decrypted
 * @param[in] t MAC to be verified
 * @param[in] tLen Length of the MAC
 * @return Error code
 **/

error_t ccmDecrypt(const CipherAlgo *cipher, void *context, const uint8_t *n,
   size_t nLen, const uint8_t *a, size_t aLen, const uint8_t *c, uint8_t *p,
   size_t length, const uint8_t *t, size_t tLen)
{
   status_t status;
   size_t keySize;
   AesContext *aesContext;
   ele_generic_aead_t genericAead;

   //Make sure the GCM context is valid
   if(context == NULL)
      return ERROR_INVALID_PARAMETER;

   //Check the length of the authentication tag
   if(tLen < 4 || tLen > 16)
      return ERROR_INVALID_LENGTH;

   //Initialize status code
   status = kStatus_Success;

   //Point to the AES context
   aesContext = (AesContext *) context;

   //Get the length of the key
   if(aesContext->nr == 10)
   {
      //10 rounds are required for 128-bit key
      keySize = 16;
   }
   else if(aesContext->nr == 12)
   {
      //12 rounds are required for 192-bit key
      keySize = 24;
   }
   else if(aesContext->nr == 14)
   {
      //14 rounds are required for 256-bit key
      keySize = 32;
   }
   else
   {
      //Invalid key length
      status = kStatus_Fail;
   }

   //Check status code
   if(status == kStatus_Success)
   {
      //Acquire exclusive access to the ELE module
      osAcquireMutex(&mimxrt1180CryptoMutex);

      //Set cipher parameters
      genericAead.data = (uint32_t) c;
      genericAead.output = (uint32_t) p;
      genericAead.size = length;
      genericAead.key = (uint32_t) aesContext->ek;
      genericAead.key_size = keySize;
      genericAead.iv = (uint32_t) n;
      genericAead.iv_size = nLen;
      genericAead.aad = (uint32_t) a;
      genericAead.aad_size = aLen;
      genericAead.tag = (uint32_t) t;
      genericAead.tag_size = tLen;
      genericAead.algo = kAES_CCM;
      genericAead.mode = kDecrypt;

      //Perform AES-CCM decryption
      status = ELE_GenericAead(MU_APPS_S3MUA, &genericAead);

      //Release exclusive access to the ELE module
      osReleaseMutex(&mimxrt1180CryptoMutex);
   }

   //Return status code
   return (status == kStatus_Success) ? NO_ERROR : ERROR_FAILURE;
}

#endif
#endif
